{"/docs/":{"data":{"":"","설치-및-연동#설치 및 연동":"준비\r플렉스트림의 일부 기능은 외부 프로그램과 환경을 필요로 합니다.\nGoogle Chrome Google Chrome을 기본 경로가 아닌 곳에 설치했을 경우 설정/Chrome 경로 항목을 참고해주세요. OBS Spout2 플러그인 설치가 필요한 경우 부록: OBS 연동\r페이지를 참고해주세요. 인터넷 연결 플렉스트림은 시간 동기화를 위해 방송 송출 여부와 상관없이 반드시 인터넷 연결이 필요합니다. 설치 및 연동\r프로그램을 다운로드하고 압축을 해제합니다. 기존 사용자의 경우, user 폴더를 옮겨오면 기존의 기록과 설정이 복구됩니다. plextream.exe 파일을 실행합니다. 연동 메뉴를 실행합니다. add\r버튼을 누르고 연동할 서비스의 방송국 또는 채널 주소를 입력합니다. 아프리카TV 예시: https://bj.afreecatv.com/... 치지직 예시: https://chzzk.naver.com/... 트위치 예시: https://www.twitch.tv/... 유튜브 예시: https://www.youtube.com/@... 연동 목록에서 로그인 버튼 login\r을 누르고 로그인합니다. 서비스 연동과 관련된 더 자세한 내용은 서비스 연동\r페이지를 참고해주세요. 이제 플렉스트림의 각종 기능을 사용할 준비가 되었습니다. 필요에 따라 다음의 페이지를 참고해주세요.\n통합 채팅 송출: 챗박스 관리\r채팅 연동 시청자 투표: 플렉서베이\r시청자 참여 그림 맞추기 게임: 플렉스케치","준비#준비":""},"title":"설명서"},"/docs/appendix/obs-integration/":{"data":{"":"","다운로드-및-설치#다운로드 및 설치":"","플러그인-사용법#플러그인 사용법":"다음 기능은 OBS 송출을 위해서 OBS용 Spout2 플러그인 설치가 필요합니다.\n챗박스 관리\r다운로드 및 설치\rOBS Spout2 플러그인 릴리즈 페이지에 접속합니다. 사용 중인 OBS 버전에 맞는 버전을 확인합니다. 2024/02/26 시점에서 최신 버전의 OBS를 사용중이라면 OBS 29 플러그인과 호환됩니다. 플러그인 설치 전에 OBS가 실행 중이라면 OBS를 종료합니다. OBS를 종료해야하기 떄문에 송출 도중에 설치할 수 없습니다. 이하 설명의 파일명은 OBS 29 플러그인을 가정하고 설명합니다. 실제 설치하는 시점의 최신 버전과 다를 수 있습니다. 기본 경로에 OBS를 설치한 경우에는 OBS_Spout2_plugin_Install_v1.8.exe 파일을 다운로드하여 실행하면 설치가 완료됩니다. 만약 OBS를 기본 경로가 아닌 다른 곳에 설치한 경우에는, OBS_Spout2_Plugin_ManualInstall_v1.8.zip 파일을 다운로드합니다. 압축을 해제하면 생기는 data와 obs-plugins 폴더 OBS가 설치된 폴더에 옮겨주면 설치가 완료됩니다. 플러그인 사용법\r플러그인 설치 후 OBS를 실행하면 추가 가능한 소스 목록에 Spout2 Capture 항목이 추가됩니다. Spout 출력을 지원하는 프로그램이 켜진 상태에서 Spout2 Capture 소스를 추가합니다. SpoutSenders 항목에서 불러올 항목을 선택합니다. 이름은 프로그램에 따라 다릅니다. 플렉스트림 챗박스는 PLEXChatBox/... 형식의 이름을 사용합니다. Composite mode 항목을 Default로 설정합니다. 정상적으로 OBS 화면에 출력되는 것을 확인합니다. "},"title":"부록: OBS 연동"},"/docs/plexchatbox/":{"data":{"":"","준비#준비":"","챗박스-만들기#챗박스 만들기":"","챗박스-송출#챗박스 송출":"플렉스트림은 연동된 서비스의 채팅을 모아서 보여주는 챗박스를 지원합니다.\n준비\r플렉스트림의 챗박스를 설정하고 OBS를 통해서 송출하기 위해서는 별도의 플러그인 설치가 필요합니다. 자세한 설치법은 부록: OBS 연동\r페이지를 참고해주세요.\n챗박스 만들기\r플렉스트림의 상단 메뉴에서 챗박스 메뉴를 눌러 챗박스 관리 창을 실행합니다. 추가 add\r버튼을 눌러 챗박스를 추가합니다. 목록에서 항목을 더블클릭하여 챗박스 이름을 변경할 수 있습니다. 목록에서 삭제 close\r버튼을 눌러 챗박스를 삭제할 수 있습니다. 너비와 높이를 설정합니다. 너비와 높이에 맞춰서 좌측의 빨간색 테두리의 체크무늬 상자가 실시간으로 변경됩니다. 빨간색 테두리와 체크무늬 배경은 미리보기에서 챗박스의 영역을 표시하기 위한 것으로 실제로 송출 화면에는 출력되지 않습니다. 만약 미리보기 창의 크기가 설정한 너비와 높이보다 작으면 비율이 유지된 채로 축소되어 표시됩니다. 실제 크기를 확인하기 위해서는 창의 크기를 충분히 크게 하고 작업해주세요. 스타일을 선택하고 속성을 설정합니다. 스타일 별로 설정가능한 속성이 다릅니다. 속성을 변경하면 실시간으로 반영됩니다. 속성별로 keyboard_arrow_right\r버튼을 누르면 플랫폼별 속성값을 설정할 수 있습니다. (상속)이라고 표시되어 있는 값은 기본 스타일의 값을 따라갑니다. 각 속성에 커서를 올렸을 때 표시되는 replay\r버튼을 누르면 초기값으로 돌릴 수 있습니다. 챗박스 테스트\r챗박스 미리보기의 챗박스 테스트를 통해서 테스트 채팅을 생성할 수 있습니다. 생성된 채팅은 플렉스트림의 챗박스에 실제로 표시되지만 해당 플랫폼에 표시되지는 않습니다. 챗박스 송출\r만든 챗박스는 Spout 인터페이스로 외부 프로그램과 연동이 가능합니다. OBS로 송출하는 경우, Page not found.\r페이지를 참고하여 OBS Spout2 플러그인을 설치합니다. Spout2 Capture 소스로 생성한 챗박스를 불러옵니다. SpoutSenders에 해당하는 이름은 챗박스 관리 창의 Spout2 값을 통해 확인할 수 있습니다. 플렉스트림의 챗박스 Spout2 인터페이스 이름은 항상 PLEXChatBox/...의 형식입니다. 플렉스트림을 종료하면 챗박스 송출도 함께 중단됩니다. 단, 플렉스트림 창을 닫아도 프로그램이 바로 종료되지 않고 시스템 트레이를 통해서 계속해서 이용가능합니다. ","챗박스-테스트#챗박스 테스트":""},"title":"챗박스 관리"},"/docs/plexervice/":{"data":{"":"","서비스-추가하기#서비스 추가하기":"플렉스트림은 다양한 플랫폼 서비스를 지원하여 동시 송출하는 스트리머를 보조할 수 있습니다. 플렉스트림 창의 상단 메뉴에서 연동 메뉴를 실행하거나, 시스템 트레이 아이콘 메뉴에서 서비스 연동 메뉴를 실행하면 서비스 연동 창을 열 수 있습니다.\n서비스 추가하기\r서비스 연동 창의 add\r버튼을 누르면 서비스 URL 창이 표시됩니다. 연동할 서비스의 URL을 입력해주세요. 입력하는 URL은 연동하는 플랫폼의 방송국 또는 채널 주소입니다.\n아프리카TV 방송국: https://bj.afreecatv.com/사용자ID 치지직 채널: https://chzzk.naver.com/사용자해시 트위치 채널: https://www.twitch.tv/사용자ID 유튜브 채널: https://www.youtube.com/@채널핸들 서비스가 추가되면 목록에서 추가된 서비스가 플랫폼 아이콘과 함께 표시됩니다. 각 항목에 대해서 다음과 같은 버튼을 이용할 수 있습니다.\n준비중입니다."},"title":"서비스 연동"},"/docs/plexketch/":{"data":{"":"준비중입니다."},"title":"플렉스케치"},"/docs/plexurvey/":{"data":{"":"준비중입니다."},"title":"플렉서베이"},"/docs/settings/":{"data":{"":"","고급-설정#고급 설정":"","로컬-서버-포트#로컬 서버 포트":"플렉스트림 메인 창의 상단의 settings\r버튼 또는 시스템 트레이 아이콘의 설정 메뉴를 통해 설정 창을 열 수 있습니다. 일부 설정은 플렉스트림을 재시작해야 적용되기 때문에 설정을 수정한 경우에는 플렉스트림을 재시작하는게 좋습니다.\n일반 설정\rChrome 경로\r플렉스트림의 일부 기능은 사용자의 PC에 설치된 Google Chrome에 의존합니다. Google Chrome이 기본 경로에 설치된 경우 자동으로 인식합니다. 만약 Chrome 경로와 관련한 오류가 발생할 경우, 직접 Chrome 경로를 설정해주세요.\nChrome 경로 찾기\rGoogle Chrome 경로는 다음과 같은 방법으로 찾을 수 있습니다.\nGoogle Chrome을 실행합니다. 작업 관리자를 실행합니다. 작업관리자는 CTRL + Win + ESC 키 조합으로 열 수 있습니다. 작업 관리자에서 Google Chrome 항목을 찾습니다. Google Chrome 항목을 더블클릭하여 펼치면 아래 이미지와 같이 여러개의 Google Chrome 하부 항목들이 표시됩니다. 아무 하부 항목을 우클릭하고 파일 위치 열기 메뉴를 선택합니다. 탐색기가 열리고 아래와 같이 chrome.exe가 표시됩니다. 탐색기 상단의 경로를 확인하고, 설정창에서 찾아보기... 버튼으로 해당 경로의 chrome.exe 파일을 선택합니다. 시스템 트레이\r시작시 자동으로 시스템 트레이에서 실행 윈도우 시작과 함께 시스템 트레이를 통해 플렉스트림이 자동으로 실행됩니다. 플렉스트림을 매번 실행하는 것이 번거로운 경우 이 설정을 적용할 수 있습니다. 창을 닫으면 시스템 트레이로 최소화 플렉스트림 창을 닫았을 때 프로그램을 종료하는 대신 시스템 트레이에서 계속해서 실행되도록 합니다. 실수로 플렉스트림을 종료하는 것을 방지하기 위해서 기본으로 체크되어 있습니다. 고급 설정\rNTP 서버\r플렉스트림은 내부적으로 정확한 현재 시간에 의존하는 기능이 많기 때문에 인터넷을 통해 시간을 자동으로 동기화합니다. NTP 서버는 정확한 시간 정보를 제공해주는 서버입니다. 만약 기본값으로 지정된 NTP 서버가 작동하지 않는 경우 직접 NTP 서버를 변경할 수 있습니다.\n로컬 서버 포트\r플렉스트림은 사용자의 PC에서 로컬 서버를 가동하여 외부 프로그램 또는 연동 서비스와 통신합니다. 만약 다른 프로그램이 사용하는 포트 번호와 중복되는 경우, 다른 포트 번호를 지정할 수 있습니다.","일반-설정#일반 설정":""},"title":"설정"}}